OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1614.h
#define AT1MISS8                AT1MISSHbits.AT1MISS8           // bit 0, shadows bit in AT1MISSHbits
#define MISS8                   AT1MISSHbits.MISS8              // bit 0, shadows bit in AT1MISSHbits
#define AT1MISS9                AT1MISSHbits.AT1MISS9           // bit 1, shadows bit in AT1MISSHbits
#define MISS9                   AT1MISSHbits.MISS9              // bit 1, shadows bit in AT1MISSHbits
#define AT1MISS10               AT1MISSHbits.AT1MISS10          // bit 2, shadows bit in AT1MISSHbits
#define MISS10                  AT1MISSHbits.MISS10             // bit 2, shadows bit in AT1MISSHbits
#define AT1MISS11               AT1MISSHbits.AT1MISS11          // bit 3, shadows bit in AT1MISSHbits
#define MISS11                  AT1MISSHbits.MISS11             // bit 3, shadows bit in AT1MISSHbits
#define AT1MISS12               AT1MISSHbits.AT1MISS12          // bit 4, shadows bit in AT1MISSHbits
#define MISS12                  AT1MISSHbits.MISS12             // bit 4, shadows bit in AT1MISSHbits
#define AT1MISS13               AT1MISSHbits.AT1MISS13          // bit 5, shadows bit in AT1MISSHbits
#define MISS13                  AT1MISSHbits.MISS13             // bit 5, shadows bit in AT1MISSHbits
#define AT1MISS14               AT1MISSHbits.AT1MISS14          // bit 6, shadows bit in AT1MISSHbits
#define MISS14                  AT1MISSHbits.MISS14             // bit 6, shadows bit in AT1MISSHbits
#define AT1MISS15               AT1MISSHbits.AT1MISS15          // bit 7, shadows bit in AT1MISSHbits
#define MISS15                  AT1MISSHbits.MISS15             // bit 7, shadows bit in AT1MISSHbits

#define AT1MISS0                AT1MISSLbits.AT1MISS0           // bit 0, shadows bit in AT1MISSLbits
#define MISS0                   AT1MISSLbits.MISS0              // bit 0, shadows bit in AT1MISSLbits
#define AT1MISS1                AT1MISSLbits.AT1MISS1           // bit 1, shadows bit in AT1MISSLbits
#define MISS1                   AT1MISSLbits.MISS1              // bit 1, shadows bit in AT1MISSLbits
#define AT1MISS2                AT1MISSLbits.AT1MISS2           // bit 2, shadows bit in AT1MISSLbits
#define MISS2                   AT1MISSLbits.MISS2              // bit 2, shadows bit in AT1MISSLbits
#define AT1MISS3                AT1MISSLbits.AT1MISS3           // bit 3, shadows bit in AT1MISSLbits
#define MISS3                   AT1MISSLbits.MISS3              // bit 3, shadows bit in AT1MISSLbits
#define AT1MISS4                AT1MISSLbits.AT1MISS4           // bit 4, shadows bit in AT1MISSLbits
#define MISS4                   AT1MISSLbits.MISS4              // bit 4, shadows bit in AT1MISSLbits
#define AT1MISS5                AT1MISSLbits.AT1MISS5           // bit 5, shadows bit in AT1MISSLbits
#define MISS5                   AT1MISSLbits.MISS5              // bit 5, shadows bit in AT1MISSLbits
#define AT1MISS6                AT1MISSLbits.AT1MISS6           // bit 6, shadows bit in AT1MISSLbits
#define MISS6                   AT1MISSLbits.MISS6              // bit 6, shadows bit in AT1MISSLbits
#define AT1MISS7                AT1MISSLbits.AT1MISS7           // bit 7, shadows bit in AT1MISSLbits
#define MISS7                   AT1MISSLbits.MISS7              // bit 7, shadows bit in AT1MISSLbits

#define AT1PER8                 AT1PERHbits.AT1PER8             // bit 0, shadows bit in AT1PERHbits
#define PER8                    AT1PERHbits.PER8                // bit 0, shadows bit in AT1PERHbits
#define PERH0                   AT1PERHbits.PERH0               // bit 0, shadows bit in AT1PERHbits
#define AT1PER9                 AT1PERHbits.AT1PER9             // bit 1, shadows bit in AT1PERHbits
#define PER9                    AT1PERHbits.PER9                // bit 1, shadows bit in AT1PERHbits
#define PERH1                   AT1PERHbits.PERH1               // bit 1, shadows bit in AT1PERHbits
#define AT1PER10                AT1PERHbits.AT1PER10            // bit 2, shadows bit in AT1PERHbits
#define PER10                   AT1PERHbits.PER10               // bit 2, shadows bit in AT1PERHbits
#define PERH2                   AT1PERHbits.PERH2               // bit 2, shadows bit in AT1PERHbits
#define AT1PER11                AT1PERHbits.AT1PER11            // bit 3, shadows bit in AT1PERHbits
#define PER11                   AT1PERHbits.PER11               // bit 3, shadows bit in AT1PERHbits
#define PERH3                   AT1PERHbits.PERH3               // bit 3, shadows bit in AT1PERHbits
#define AT1PER12                AT1PERHbits.AT1PER12            // bit 4, shadows bit in AT1PERHbits
#define PER12                   AT1PERHbits.PER12               // bit 4, shadows bit in AT1PERHbits
#define PERH4                   AT1PERHbits.PERH4               // bit 4, shadows bit in AT1PERHbits
#define AT1PER13                AT1PERHbits.AT1PER13            // bit 5, shadows bit in AT1PERHbits
#define PER13                   AT1PERHbits.PER13               // bit 5, shadows bit in AT1PERHbits
#define PERH5                   AT1PERHbits.PERH5               // bit 5, shadows bit in AT1PERHbits
#define AT1PER14                AT1PERHbits.AT1PER14            // bit 6, shadows bit in AT1PERHbits
#define PER14                   AT1PERHbits.PER14               // bit 6, shadows bit in AT1PERHbits
#define PERH6                   AT1PERHbits.PERH6               // bit 6, shadows bit in AT1PERHbits
#define AT1POV                  AT1PERHbits.AT1POV              // bit 7, shadows bit in AT1PERHbits
#define PER15                   AT1PERHbits.PER15               // bit 7, shadows bit in AT1PERHbits
#define PERH7                   AT1PERHbits.PERH7               // bit 7, shadows bit in AT1PERHbits

#define AT1PER0                 AT1PERLbits.AT1PER0             // bit 0, shadows bit in AT1PERLbits
#define PER0                    AT1PERLbits.PER0                // bit 0, shadows bit in AT1PERLbits
#define PERL0                   AT1PERLbits.PERL0               // bit 0, shadows bit in AT1PERLbits
#define AT1PER1                 AT1PERLbits.AT1PER1             // bit 1, shadows bit in AT1PERLbits
#define PER1                    AT1PERLbits.PER1                // bit 1, shadows bit in AT1PERLbits
#define PERL1                   AT1PERLbits.PERL1               // bit 1, shadows bit in AT1PERLbits
#define AT1PER2                 AT1PERLbits.AT1PER2             // bit 2, shadows bit in AT1PERLbits
#define PER2                    AT1PERLbits.PER2                // bit 2, shadows bit in AT1PERLbits
#define PERL2                   AT1PERLbits.PERL2               // bit 2, shadows bit in AT1PERLbits
#define AT1PER3                 AT1PERLbits.AT1PER3             // bit 3, shadows bit in AT1PERLbits
#define PER3                    AT1PERLbits.PER3                // bit 3, shadows bit in AT1PERLbits
#define PERL3                   AT1PERLbits.PERL3               // bit 3, shadows bit in AT1PERLbits
#define AT1PER4                 AT1PERLbits.AT1PER4             // bit 4, shadows bit in AT1PERLbits
#define PER4                    AT1PERLbits.PER4                // bit 4, shadows bit in AT1PERLbits
#define PERL4                   AT1PERLbits.PERL4               // bit 4, shadows bit in AT1PERLbits
#define AT1PER5                 AT1PERLbits.AT1PER5             // bit 5, shadows bit in AT1PERLbits
#define PER5                    AT1PERLbits.PER5                // bit 5, shadows bit in AT1PERLbits
#define PERL5                   AT1PERLbits.PERL5               // bit 5, shadows bit in AT1PERLbits
#define AT1PER6                 AT1PERLbits.AT1PER6             // bit 6, shadows bit in AT1PERLbits
#define PER6                    AT1PERLbits.PER6                // bit 6, shadows bit in AT1PERLbits
#define PERL6                   AT1PERLbits.PERL6               // bit 6, shadows bit in AT1PERLbits
#define AT1PER7                 AT1PERLbits.AT1PER7             // bit 7, shadows bit in AT1PERLbits
#define PER7                    AT1PERLbits.PER7                // bit 7, shadows bit in AT1PERLbits
#define PERL7                   AT1PERLbits.PERL7               // bit 7, shadows bit in AT1PERLbits

