OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1614.h
#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0
#define NOT_POR                 PCONbits.NOT_POR                // bit 1
#define NOT_RI                  PCONbits.NOT_RI                 // bit 2
#define NOT_RMCLR               PCONbits.NOT_RMCLR              // bit 3
#define NOT_RWDT                PCONbits.NOT_RWDT               // bit 4
#define NOT_WDTWV               PCONbits.NOT_WDTWV              // bit 5
#define STKUNF                  PCONbits.STKUNF                 // bit 6
#define STKOVF                  PCONbits.STKOVF                 // bit 7

#define PID1ACC24               PID1ACCHHbits.PID1ACC24         // bit 0, shadows bit in PID1ACCHHbits
#define ACC24                   PID1ACCHHbits.ACC24             // bit 0, shadows bit in PID1ACCHHbits
#define PID1ACC25               PID1ACCHHbits.PID1ACC25         // bit 1, shadows bit in PID1ACCHHbits
#define ACC25                   PID1ACCHHbits.ACC25             // bit 1, shadows bit in PID1ACCHHbits
#define PID1ACC26               PID1ACCHHbits.PID1ACC26         // bit 2, shadows bit in PID1ACCHHbits
#define ACC26                   PID1ACCHHbits.ACC26             // bit 2, shadows bit in PID1ACCHHbits
#define PID1ACC27               PID1ACCHHbits.PID1ACC27         // bit 3, shadows bit in PID1ACCHHbits
#define ACC27                   PID1ACCHHbits.ACC27             // bit 3, shadows bit in PID1ACCHHbits
#define PID1ACC28               PID1ACCHHbits.PID1ACC28         // bit 4, shadows bit in PID1ACCHHbits
#define ACC28                   PID1ACCHHbits.ACC28             // bit 4, shadows bit in PID1ACCHHbits
#define PID1ACC29               PID1ACCHHbits.PID1ACC29         // bit 5, shadows bit in PID1ACCHHbits
#define ACC29                   PID1ACCHHbits.ACC29             // bit 5, shadows bit in PID1ACCHHbits
#define PID1ACC30               PID1ACCHHbits.PID1ACC30         // bit 6, shadows bit in PID1ACCHHbits
#define ACC30                   PID1ACCHHbits.ACC30             // bit 6, shadows bit in PID1ACCHHbits
#define PID1ACC31               PID1ACCHHbits.PID1ACC31         // bit 7, shadows bit in PID1ACCHHbits
#define ACC31                   PID1ACCHHbits.ACC31             // bit 7, shadows bit in PID1ACCHHbits

#define PID1ACC16               PID1ACCHLbits.PID1ACC16         // bit 0, shadows bit in PID1ACCHLbits
#define ACC16                   PID1ACCHLbits.ACC16             // bit 0, shadows bit in PID1ACCHLbits
#define PID1ACC17               PID1ACCHLbits.PID1ACC17         // bit 1, shadows bit in PID1ACCHLbits
#define ACC17                   PID1ACCHLbits.ACC17             // bit 1, shadows bit in PID1ACCHLbits
#define PID1ACC18               PID1ACCHLbits.PID1ACC18         // bit 2, shadows bit in PID1ACCHLbits
#define ACC18                   PID1ACCHLbits.ACC18             // bit 2, shadows bit in PID1ACCHLbits
#define PID1ACC19               PID1ACCHLbits.PID1ACC19         // bit 3, shadows bit in PID1ACCHLbits
#define ACC19                   PID1ACCHLbits.ACC19             // bit 3, shadows bit in PID1ACCHLbits
#define PID1ACC20               PID1ACCHLbits.PID1ACC20         // bit 4, shadows bit in PID1ACCHLbits
#define ACC20                   PID1ACCHLbits.ACC20             // bit 4, shadows bit in PID1ACCHLbits
#define PID1ACC21               PID1ACCHLbits.PID1ACC21         // bit 5, shadows bit in PID1ACCHLbits
#define ACC21                   PID1ACCHLbits.ACC21             // bit 5, shadows bit in PID1ACCHLbits
#define PID1ACC22               PID1ACCHLbits.PID1ACC22         // bit 6, shadows bit in PID1ACCHLbits
#define ACC22                   PID1ACCHLbits.ACC22             // bit 6, shadows bit in PID1ACCHLbits
#define PID1ACC23               PID1ACCHLbits.PID1ACC23         // bit 7, shadows bit in PID1ACCHLbits
#define ACC23                   PID1ACCHLbits.ACC23             // bit 7, shadows bit in PID1ACCHLbits

#define PID1ACC32               PID1ACCUbits.PID1ACC32          // bit 0, shadows bit in PID1ACCUbits
#define ACC32                   PID1ACCUbits.ACC32              // bit 0, shadows bit in PID1ACCUbits
#define PID1ACC33               PID1ACCUbits.PID1ACC33          // bit 1, shadows bit in PID1ACCUbits
#define ACC33                   PID1ACCUbits.ACC33              // bit 1, shadows bit in PID1ACCUbits
#define PID1ACC34               PID1ACCUbits.PID1ACC34          // bit 2, shadows bit in PID1ACCUbits
#define ACC34                   PID1ACCUbits.ACC34              // bit 2, shadows bit in PID1ACCUbits

#define PID1IN8                 PID1INHbits.PID1IN8             // bit 0, shadows bit in PID1INHbits
#define IN8                     PID1INHbits.IN8                 // bit 0, shadows bit in PID1INHbits
#define PID1IN9                 PID1INHbits.PID1IN9             // bit 1, shadows bit in PID1INHbits
#define IN9                     PID1INHbits.IN9                 // bit 1, shadows bit in PID1INHbits
#define PID1IN10                PID1INHbits.PID1IN10            // bit 2, shadows bit in PID1INHbits
#define IN10                    PID1INHbits.IN10                // bit 2, shadows bit in PID1INHbits
#define PID1IN11                PID1INHbits.PID1IN11            // bit 3, shadows bit in PID1INHbits
#define IN11                    PID1INHbits.IN11                // bit 3, shadows bit in PID1INHbits
#define PID1IN12                PID1INHbits.PID1IN12            // bit 4, shadows bit in PID1INHbits
#define IN12                    PID1INHbits.IN12                // bit 4, shadows bit in PID1INHbits
#define PID1IN13                PID1INHbits.PID1IN13            // bit 5, shadows bit in PID1INHbits
#define IN13                    PID1INHbits.IN13                // bit 5, shadows bit in PID1INHbits
#define PID1IN14                PID1INHbits.PID1IN14            // bit 6, shadows bit in PID1INHbits
#define IN14                    PID1INHbits.IN14                // bit 6, shadows bit in PID1INHbits
#define PID1IN15                PID1INHbits.PID1IN15            // bit 7, shadows bit in PID1INHbits
#define IN15                    PID1INHbits.IN15                // bit 7, shadows bit in PID1INHbits

