OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1614.h
#define PID1Z18                 PID1Z1Hbits.PID1Z18             // bit 0, shadows bit in PID1Z1Hbits
#define Z18                     PID1Z1Hbits.Z18                 // bit 0, shadows bit in PID1Z1Hbits
#define PID1Z19                 PID1Z1Hbits.PID1Z19             // bit 1, shadows bit in PID1Z1Hbits
#define Z19                     PID1Z1Hbits.Z19                 // bit 1, shadows bit in PID1Z1Hbits
#define PID1Z110                PID1Z1Hbits.PID1Z110            // bit 2, shadows bit in PID1Z1Hbits
#define Z110                    PID1Z1Hbits.Z110                // bit 2, shadows bit in PID1Z1Hbits
#define PID1Z111                PID1Z1Hbits.PID1Z111            // bit 3, shadows bit in PID1Z1Hbits
#define Z111                    PID1Z1Hbits.Z111                // bit 3, shadows bit in PID1Z1Hbits
#define PID1Z112                PID1Z1Hbits.PID1Z112            // bit 4, shadows bit in PID1Z1Hbits
#define Z112                    PID1Z1Hbits.Z112                // bit 4, shadows bit in PID1Z1Hbits
#define PID1Z113                PID1Z1Hbits.PID1Z113            // bit 5, shadows bit in PID1Z1Hbits
#define Z113                    PID1Z1Hbits.Z113                // bit 5, shadows bit in PID1Z1Hbits
#define PID1Z114                PID1Z1Hbits.PID1Z114            // bit 6, shadows bit in PID1Z1Hbits
#define Z114                    PID1Z1Hbits.Z114                // bit 6, shadows bit in PID1Z1Hbits
#define PID1Z115                PID1Z1Hbits.PID1Z115            // bit 7, shadows bit in PID1Z1Hbits
#define Z115                    PID1Z1Hbits.Z115                // bit 7, shadows bit in PID1Z1Hbits

#define PID1Z10                 PID1Z1Lbits.PID1Z10             // bit 0, shadows bit in PID1Z1Lbits
#define Z10                     PID1Z1Lbits.Z10                 // bit 0, shadows bit in PID1Z1Lbits
#define PID1Z11                 PID1Z1Lbits.PID1Z11             // bit 1, shadows bit in PID1Z1Lbits
#define Z11                     PID1Z1Lbits.Z11                 // bit 1, shadows bit in PID1Z1Lbits
#define PID1Z12                 PID1Z1Lbits.PID1Z12             // bit 2, shadows bit in PID1Z1Lbits
#define Z12                     PID1Z1Lbits.Z12                 // bit 2, shadows bit in PID1Z1Lbits
#define PID1Z13                 PID1Z1Lbits.PID1Z13             // bit 3, shadows bit in PID1Z1Lbits
#define Z13                     PID1Z1Lbits.Z13                 // bit 3, shadows bit in PID1Z1Lbits
#define PID1Z14                 PID1Z1Lbits.PID1Z14             // bit 4, shadows bit in PID1Z1Lbits
#define Z14                     PID1Z1Lbits.Z14                 // bit 4, shadows bit in PID1Z1Lbits
#define PID1Z15                 PID1Z1Lbits.PID1Z15             // bit 5, shadows bit in PID1Z1Lbits
#define Z15                     PID1Z1Lbits.Z15                 // bit 5, shadows bit in PID1Z1Lbits
#define PID1Z16                 PID1Z1Lbits.PID1Z16             // bit 6, shadows bit in PID1Z1Lbits
#define Z16                     PID1Z1Lbits.Z16                 // bit 6, shadows bit in PID1Z1Lbits
#define PID1Z17                 PID1Z1Lbits.PID1Z17             // bit 7, shadows bit in PID1Z1Lbits
#define Z17                     PID1Z1Lbits.Z17                 // bit 7, shadows bit in PID1Z1Lbits

#define PID1Z116                PID1Z1Ubits.PID1Z116            // bit 0, shadows bit in PID1Z1Ubits
#define Z116                    PID1Z1Ubits.Z116                // bit 0, shadows bit in PID1Z1Ubits

#define PID1Z28                 PID1Z2Hbits.PID1Z28             // bit 0, shadows bit in PID1Z2Hbits
#define Z28                     PID1Z2Hbits.Z28                 // bit 0, shadows bit in PID1Z2Hbits
#define PID1Z29                 PID1Z2Hbits.PID1Z29             // bit 1, shadows bit in PID1Z2Hbits
#define Z29                     PID1Z2Hbits.Z29                 // bit 1, shadows bit in PID1Z2Hbits
#define PID1Z210                PID1Z2Hbits.PID1Z210            // bit 2, shadows bit in PID1Z2Hbits
#define Z210                    PID1Z2Hbits.Z210                // bit 2, shadows bit in PID1Z2Hbits
#define PID1Z211                PID1Z2Hbits.PID1Z211            // bit 3, shadows bit in PID1Z2Hbits
#define Z211                    PID1Z2Hbits.Z211                // bit 3, shadows bit in PID1Z2Hbits
#define PID1Z212                PID1Z2Hbits.PID1Z212            // bit 4, shadows bit in PID1Z2Hbits
#define Z212                    PID1Z2Hbits.Z212                // bit 4, shadows bit in PID1Z2Hbits
#define PID1Z213                PID1Z2Hbits.PID1Z213            // bit 5, shadows bit in PID1Z2Hbits
#define Z213                    PID1Z2Hbits.Z213                // bit 5, shadows bit in PID1Z2Hbits
#define PID1Z214                PID1Z2Hbits.PID1Z214            // bit 6, shadows bit in PID1Z2Hbits
#define Z214                    PID1Z2Hbits.Z214                // bit 6, shadows bit in PID1Z2Hbits
#define PID1Z215                PID1Z2Hbits.PID1Z215            // bit 7, shadows bit in PID1Z2Hbits
#define Z215                    PID1Z2Hbits.Z215                // bit 7, shadows bit in PID1Z2Hbits

#define PID1Z20                 PID1Z2Lbits.PID1Z20             // bit 0, shadows bit in PID1Z2Lbits
#define Z20                     PID1Z2Lbits.Z20                 // bit 0, shadows bit in PID1Z2Lbits
#define PID1Z21                 PID1Z2Lbits.PID1Z21             // bit 1, shadows bit in PID1Z2Lbits
#define Z21                     PID1Z2Lbits.Z21                 // bit 1, shadows bit in PID1Z2Lbits
#define PID1Z22                 PID1Z2Lbits.PID1Z22             // bit 2, shadows bit in PID1Z2Lbits
#define Z22                     PID1Z2Lbits.Z22                 // bit 2, shadows bit in PID1Z2Lbits
#define PID1Z23                 PID1Z2Lbits.PID1Z23             // bit 3, shadows bit in PID1Z2Lbits
#define Z23                     PID1Z2Lbits.Z23                 // bit 3, shadows bit in PID1Z2Lbits
#define PID1Z24                 PID1Z2Lbits.PID1Z24             // bit 4, shadows bit in PID1Z2Lbits
#define Z24                     PID1Z2Lbits.Z24                 // bit 4, shadows bit in PID1Z2Lbits
#define PID1Z25                 PID1Z2Lbits.PID1Z25             // bit 5, shadows bit in PID1Z2Lbits
#define Z25                     PID1Z2Lbits.Z25                 // bit 5, shadows bit in PID1Z2Lbits
#define PID1Z26                 PID1Z2Lbits.PID1Z26             // bit 6, shadows bit in PID1Z2Lbits
#define Z26                     PID1Z2Lbits.Z26                 // bit 6, shadows bit in PID1Z2Lbits
#define PID1Z27                 PID1Z2Lbits.PID1Z27             // bit 7, shadows bit in PID1Z2Lbits
#define Z27                     PID1Z2Lbits.Z27                 // bit 7, shadows bit in PID1Z2Lbits

#define PID1Z216                PID1Z2Ubits.PID1Z216            // bit 0, shadows bit in PID1Z2Ubits
#define Z216                    PID1Z2Ubits.Z216                // bit 0, shadows bit in PID1Z2Ubits

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1
#define CCP1IE                  PIE1bits.CCP1IE                 // bit 2
#define SSP1IE                  PIE1bits.SSP1IE                 // bit 3
#define TXIE                    PIE1bits.TXIE                   // bit 4
#define RCIE                    PIE1bits.RCIE                   // bit 5
#define ADIE                    PIE1bits.ADIE                   // bit 6
#define TMR1GIE                 PIE1bits.TMR1GIE                // bit 7

#define CCP2IE                  PIE2bits.CCP2IE                 // bit 0
#define TMR4IE                  PIE2bits.TMR4IE                 // bit 1
#define TMR6IE                  PIE2bits.TMR6IE                 // bit 2
#define BCL1IE                  PIE2bits.BCL1IE                 // bit 3
#define C1IE                    PIE2bits.C1IE                   // bit 5
#define C2IE                    PIE2bits.C2IE                   // bit 6

#define CLC1IE                  PIE3bits.CLC1IE                 // bit 0
#define CLC2IE                  PIE3bits.CLC2IE                 // bit 1
#define ZCDIE                   PIE3bits.ZCDIE                  // bit 4
#define CWGIE                   PIE3bits.CWGIE                  // bit 5

